{
  "class_name": "Functional",
  "config": {
    "name": "model",
    "layers": [
      {
        "class_name": "Concatenate",
        "config": {
          "name": "conv5_block31_concat",
          "trainable": false,
          "dtype": "float32",
          "axis": 3
        },
        "name": "conv5_block31_concat",
        "inbound_nodes": [
          [
            [
              "conv5_block30_concat",
              0,
              0,
              {}
            ],
            [
              "conv5_block31_2_conv",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "conv5_block32_0_bn",
          "trainable": true,
          "dtype": "float32",
          "axis": [
            3
          ],
          "momentum": 0.99,
          "epsilon": 1.001e-05,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "name": "conv5_block32_0_bn",
        "inbound_nodes": [
          [
            [
              "conv5_block31_concat",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Activation",
        "config": {
          "name": "conv5_block32_0_relu",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "name": "conv5_block32_0_relu",
        "inbound_nodes": [
          [
            [
              "conv5_block32_0_bn",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv5_block32_1_conv",
          "trainable": true,
          "dtype": "float32",
          "filters": 128,
          "kernel_size": [
            1,
            1
          ],
          "strides": [
            1,
            1
          ],
          "padding": "valid",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "groups": 1,
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "conv5_block32_1_conv",
        "inbound_nodes": [
          [
            [
              "conv5_block32_0_relu",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "conv5_block32_1_bn",
          "trainable": true,
          "dtype": "float32",
          "axis": [
            3
          ],
          "momentum": 0.99,
          "epsilon": 1.001e-05,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "name": "conv5_block32_1_bn",
        "inbound_nodes": [
          [
            [
              "conv5_block32_1_conv",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Activation",
        "config": {
          "name": "conv5_block32_1_relu",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "name": "conv5_block32_1_relu",
        "inbound_nodes": [
          [
            [
              "conv5_block32_1_bn",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv5_block32_2_conv",
          "trainable": true,
          "dtype": "float32",
          "filters": 32,
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "groups": 1,
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "conv5_block32_2_conv",
        "inbound_nodes": [
          [
            [
              "conv5_block32_1_relu",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Concatenate",
        "config": {
          "name": "conv5_block32_concat",
          "trainable": true,
          "dtype": "float32",
          "axis": 3
        },
        "name": "conv5_block32_concat",
        "inbound_nodes": [
          [
            [
              "conv5_block31_concat",
              0,
              0,
              {}
            ],
            [
              "conv5_block32_2_conv",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "bn",
          "trainable": true,
          "dtype": "float32",
          "axis": [
            3
          ],
          "momentum": 0.99,
          "epsilon": 1.001e-05,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "name": "bn",
        "inbound_nodes": [
          [
            [
              "conv5_block32_concat",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Activation",
        "config": {
          "name": "relu",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "name": "relu",
        "inbound_nodes": [
          [
            [
              "bn",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "GlobalAveragePooling2D",
        "config": {
          "name": "global_average_pooling2d",
          "trainable": true,
          "dtype": "float32",
          "data_format": "channels_last"
        },
        "name": "global_average_pooling2d",
        "inbound_nodes": [
          [
            [
              "relu",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization",
          "trainable": true,
          "dtype": "float32",
          "axis": [
            1
          ],
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "name": "batch_normalization",
        "inbound_nodes": [
          [
            [
              "global_average_pooling2d",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Dropout",
        "config": {
          "name": "dropout",
          "trainable": true,
          "dtype": "float32",
          "rate": 0.2,
          "noise_shape": null,
          "seed": null
        },
        "name": "dropout",
        "inbound_nodes": [
          [
            [
              "batch_normalization",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "dense",
          "trainable": true,
          "dtype": "float32",
          "units": 1024,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "dense",
        "inbound_nodes": [
          [
            [
              "dropout",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "dense_1",
          "trainable": true,
          "dtype": "float32",
          "units": 512,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "dense_1",
        "inbound_nodes": [
          [
            [
              "dense",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_1",
          "trainable": true,
          "dtype": "float32",
          "axis": [
            1
          ],
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "name": "batch_normalization_1",
        "inbound_nodes": [
          [
            [
              "dense_1",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Dropout",
        "config": {
          "name": "dropout_1",
          "trainable": true,
          "dtype": "float32",
          "rate": 0.2,
          "noise_shape": null,
          "seed": null
        },
        "name": "dropout_1",
        "inbound_nodes": [
          [
            [
              "batch_normalization_1",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "dense_2",
          "trainable": true,
          "dtype": "float32",
          "units": 3,
          "activation": "softmax",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "dense_2",
        "inbound_nodes": [
          [
            [
              "dropout_1",
              0,
              0,
              {}
            ]
          ]
        ]
      }
    ],
    "input_layers": [
      [
        "input_1",
        0,
        0
      ]
    ],
    "output_layers": [
      [
        "dense_2",
        0,
        0
      ]
    ]
  },
  "keras_version": "2.4.0",
  "backend": "tensorflow"
}